app/controllers/gamestats_controller.rb

SELECT "gamestats".* FROM "gamestats"
---
  def index
    @gamestats = Gamestat.all

SELECT  "gamestats".* FROM "gamestats"  WHERE "gamestats"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_gamestat
      @gamestat = Gamestat.find(params[:id])