app/controllers/jornadas_controller.rb

  def index
    @jornadas = Jornada.all
---
SELECT "jornadas".* FROM "jornadas"

  def show
    @matches = Match.where(jornada_id: params[:id])
    n = 0
    @partidos = []
      @matches.each do |match|
       @partidos[n] = match.id
       n += 1
      end
    @results = Gamestat.where(match_id: @partidos,player_id: [-1,-2])
    @puntos = Gamestat.where(match_id: @partidos).where.not(player_id: [-1,-2]).limit(10).order("puntos DESC")
    @rebotes = Gamestat.where(match_id: @partidos).where.not(player_id: [-1,-2]).limit(10).order("rebotes DESC")
    @asistencias = Gamestat.where(match_id: @partidos).where.not(player_id: [-1,-2]).limit(10).order("assistencias DESC")
    @robos = Gamestat.where(match_id: @partidos).where.not(player_id: [-1,-2]).limit(10).order("robos DESC")
    @tapones = Gamestat.where(match_id: @partidos).where.not(player_id: [-1,-2]).limit(10).order("tapones DESC")
    @valoracion = Gamestat.where(match_id: @partidos).where.not(player_id: [-1,-2]).limit(10).order("valoracion DESC")
---
SELECT "matches".* FROM "matches"  WHERE "matches"."jornada_id" = 39
SELECT "matches".* FROM "matches"  WHERE "matches"."match_id" = '39'
SELECT "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (81, 82, 83, 84, 85, 86, 87, 88, 89, 90) AND "gamestats"."player_id" IN (-1, -2)
SELECT  "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (81, 82, 83, 84, 85, 86, 87, 88, 89, 90) AND ("gamestats"."player_id" NOT IN (-1, -2))  ORDER BY puntos DESC LIMIT 10
SELECT  "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (81, 82, 83, 84, 85, 86, 87, 88, 89, 90) AND ("gamestats"."player_id" NOT IN (-1, -2))  ORDER BY rebotes DESC LIMIT 10
SELECT  "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (81, 82, 83, 84, 85, 86, 87, 88, 89, 90)  ORDER BY assistencias DESC LIMIT 10
SELECT  "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (81, 82, 83, 84, 85, 86, 87, 88, 89, 90)  ORDER BY robos DESC LIMIT 10
SELECT  "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (81, 82, 83, 84, 85, 86, 87, 88, 89, 90)  ORDER BY tapones DESC LIMIT 10
SELECT  "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (81, 82, 83, 84, 85, 86, 87, 88, 89, 90) AND ("gamestats"."player_id" NOT IN (-1, -2))  ORDER BY valoracion DESC LIMIT 10

    def set_jornada
      @jornada = Jornada.find(params[:id])
---
SELECT  "jornadas".* FROM "jornadas"  WHERE "jornadas"."id" = $1 LIMIT 1  [["id", 39]]