app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT "leagues".* FROM "leagues"

  def show
    @jornadas = Jornada.where(league_id: params[:id] , season_id: "0")


      jornadas = []
    j = 0
    @jornadas.each do |jornada|
      jornadas[j] = jornada.id
        j+=1
      end


    @matches = Match.where(jornada_id: jornadas)

    n = 0
    partidos = []
      @matches.each do |match|
       partidos[n] = match.id
       n += 1
      end


    @results = Gamestat.where(match_id: partidos, player_id: [-1,-2])
---
SELECT "jornadas".* FROM "jornadas"  WHERE "jornadas"."league_id" = 0 AND "jornadas"."season_id" = 0
SELECT "matches".* FROM "matches"  WHERE "matches"."jornada_id" IN (21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
SELECT "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200)

  def create
    @league = League.new(league_params)

    respond_to do |format|
      if @league.save
---
INSERT INTO "leagues" ("created_at", "season_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-12-11 21:36:19.763803"], ["season_id", 0], ["updated_at", "2014-12-11 21:36:19.763803"]]

  def update
    respond_to do |format|
      if @league.update(league_params)
---
UPDATE "leagues" SET "season_id" = $1, "updated_at" = $2 WHERE "leagues"."id" = 1  [["season_id", 0], ["updated_at", "2014-12-20 22:58:52.827077"]]

  def destroy
    @league.destroy
---
DELETE FROM "leagues" WHERE "leagues"."id" = $1  [["id", 2]]

    def set_league
      @league = League.find(params[:id])
---
SELECT  "leagues".* FROM "leagues"  WHERE "leagues"."id" = $1 LIMIT 1  [["id", 2]]