app/controllers/matches_controller.rb

  def index
    @matches = Match.all
---
SELECT "matches".* FROM "matches"

  def show
    @gamestats = Gamestat.where(match_id: params[:id])
---
SELECT "gamestats".* FROM "gamestats"  WHERE "gamestats"."match_id" = 703

    def set_match
      @match = Match.find(params[:id])
---
SELECT  "matches".* FROM "matches"  WHERE "matches"."id" = $1 LIMIT 1  [["id", 703]]