app/controllers/seasons_controller.rb

SELECT "seasons".* FROM "seasons"
---
  def index
    @seasons = Season.all