app/controllers/teams_controller.rb

SELECT "players".* FROM "players"  WHERE "players"."team_id" = 1
---
  def show
    @players = Player.where(team_id: params[:id])

SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_team
      @team = Team.find(params[:id])